// Ex1.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>
#include "Vehicle.h"
#include "Bicycle.h"
#include "Car.h"

using std::cin;
using std::cout;
using std::endl;

/*
Напишете клас Vehicle, представляващ превозно средство. Обектите от този клас съдържат информация за:

цвят
марка
година на производство
брой места/брой пътници, които може да превози
максимална скорост, която превозното средство може да развие

Напишете клас Bicycle, наследяващ Vehicle. Освен това, той има и полета с информация за:

брой скорости
дали има светлини
дали има звънче
Да се реализира клас Car, наследяващ Vehicle. Този клас съдържа още:

модел
брой врати
мощност на двигателя в конски сили.

За Vehicle, Bicycle и Car, реализирайте конструктор по подразбиране, 
копиращ конструктор, оператор = и деструктор за класа.
По желание да се реализират и други конструктори, 
като е желателно да се добавят и гетъри и сетъри за собствените полета на класа.
*/

int main()
{
    std::cout << "Hello World!\n";
}

