// Ex1.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include "ComplexNumber.h"

using std::cin;
using std::cout;
using std::endl;

/*
Създайте клас представляващ комплексно число. Предефинирайте оператори със следната функционалност:

събиране на две комплексни числа
изваждане на две комплексни числа
умножение на две комплексни числа
деление на две комплексни числа
получаване на комплексно спрегнато
вход и изход от поток

Въвеждаме следната частична наредба за комплексните числа z1 и z2:
Нека z1 = (a1,b1) и
     z2 = (a2,b2),
     a1,a2,b1,b2∈R

Казваме, че z1<z2  ⟺  a1<a2∨(a1=a2∧b1<b2)

Предефинирайте оператори, които сравняват 2 комплексни числа по тази частична наредба.
*/

int main()
{
    ComplexNumber n1{5,3};
    ComplexNumber n2{5,8};

    cout << (n1 < n2) << endl;

    n1 += n2;

    cout << n1;

    cout << ((2*n1) / n2);


}

