// Ex3.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>
#include "Matrix.h"

using std::cin;
using std::cout;
using std::endl;

/*
Създайте клас, представящ матрица от цели числа с произволни размери. Класът трябва да има:

конструктор с параметри - 2 числа, които да определят размера на матрицата
конструктор по подразбиране (по default размерите са 2х2) Оператори:
+= - за събиране на матрици
+
-= - за изваждане на матрици
++ и -- за инкрементиране и декрементиране на всеки един елемент в матрицата(предефинирайте и prefix и postfix)
*= - за умножаване на матрица с число
*
*= - за умножаване на две матрици
*
== - 2 матрици са равни, ако всичките им елементи са равни
!=
[] - връща реда от матрицата на съответния индекс (за константен и неконстантен достъп)
оператори за сравнение <,>=,>,<=, които сравняват сумата на всички елементи
function call operator(), който връща транспонирана матрица
operator bool - връща false, ако матрицата е нулевата. В противен случай връща true.
*/

int main()
{
    Matrix m1(3, 2);
    Matrix m2(2, 5);
    
    m1[0][0] = 1; m1[0][1] = 2;
    m1[1][0] = 3; m1[1][1] = 4;
    m1[2][0] = 3; m1[2][1] = 4;

    m2[0][0] = 1; m2[0][1] = 2; m2[0][2] = 2; m2[0][3] = 2; m2[0][4] = 2;
    m2[1][0] = 3; m2[1][1] = 4; m2[1][2] = 2; m2[1][3] = 2; m2[1][4] = 2;

    cout << m1();

    cout << m1 * m2;
}